#+title: Config
**** Package and macro setup
 The latex preamble used for latex fragment previews is governed by org-format-latex-header, while export is governed by org-latex-classes and org-latex-default-class
 To add more macros to both that preamble and (multiple) export preambles, we define a variable to hold macros, then append that to the other preambles.
 LaTeX note: amsmath defines a bunch of standard operators [[http://mirror.utexas.edu/ctan/macros/latex/required/amsmath/amsopn.pdf][here]]. Some of these are 'incorrect', i.e. $\hom$ should typeset Hom, not hom. The LaTeX code "\let\hom\undefined" unbinds $\hom$, assuming \undefined is, in fact, undefined.
 Semantic notes:
  - $\id$ is the identity map
  - $\ker,\coker,\im$ are kernel, cokernel, image of a function. \ker is defined by default.
  - $\hom$ is a space of homomorphism, or the set of morphisms between two objects in a category
  - $\ext$ is an Ext functor
  - $\shom$ and $\sext$ are sheafy versions of their non-s namesakes
  - $\tensor$ is tne tensor product of two modules/other
  - $\spec$ is the affine scheme of a ring
  - $\proj$ is the projective scheme of a graded ring
  - \(\pic\) denotes Picard groups
  - $\codim$ is codimension
  - $\Supp$ denotes support of something, e.g. a sheaf
  - \(\dualab{A}\) indicates the dual abelian variety of \(A\) (i.e. \(\pic^0(A)\)
  - \(\sh F\): Typeface for sheaves
  - \proofstep is for partitioning long proofs into individual steps, to be used inside \begin{proof} environment. From https://tex.stackexchange.com/questions/207309/how-to-nicely-split-proofs-into-different-parts
 #+begin_src emacs-lisp
(after! org
  ;; Make more LaTeX packages available for org and exported latex. These packages are added to preamble of exported latex. If t is specified, the package is also available when viewing latex snippets in org-mode.
  (setq org-latex-packages-alist
        '(("" "etoolbox" t) ;; programming logic for \abs, \norm, \inner commands
          ("" "microtype" t) ;; typographic improvements
          ("" "mathrsfs" t) ;; \mathscr font
          ("AUTO" "babel" t) ;; gets passed options from \documentclass as well
          ("" "tikz" t)
          ("" "tikz-cd" t)
          ("" "amsthm" t)
          ("" "thmtools" t)
          ("" "thm-restate" t)
          ("" "xpatch" t)
          ("autostyle" "csquotes" t)))

  (setq mbv/my-latex-macros
        "
% Biblatex setup
\\usepackage[backend=biber,style=alphabetic,giveninits=true,url=true,eprint=true,doi=false,isbn=false]{biblatex}
% Suppress 'In: JournalTitle' and just write 'JournalTitle' instead for journal articles.
% From: https://tex.stackexchange.com/questions/10682/suppress-in-biblatex
\\renewbibmacro{in:}{%
  \\ifentrytype{article}{}{\\printtext{\\bibstring{in}\\intitlepunct}}}

% All tikzcd cells are in displaystyle by default
\\tikzcdset{
  cells={font=\\everymath\\expandafter{\\the\\everymath\\displaystyle}},
}

\\DeclareMathOperator\\id{id}
\\DeclareMathOperator\\coker{coker}
\\DeclareMathOperator\\im{im}
\\DeclareMathOperator\\codim{codim}
\\let\\hom\\undefined
\\DeclareMathOperator\\hom{Hom}
\\DeclareMathOperator\\shom{\\underline{Hom}}
\\DeclareMathOperator\\ext{Ext}
\\DeclareMathOperator\\sext{\\underline{Ext}}
\\DeclareMathOperator\\tor{Tor}
\\DeclareMathOperator\\rk{rk}
\\newcommand\\tensor{\\otimes}
\\DeclareMathOperator\\spec{Spec}
\\DeclareMathOperator\\proj{Proj}
\\DeclareMathOperator\\pic{Pic}
\\DeclareMathOperator\\supp{Supp}
\\newcommand\\dualab\\widehat
\\newcommand\\sh\\mathscr

\\makeatletter
\\newcounter{proofstep}
\\xpretocmd{\\proof}{\\setcounter{proofstep}{0}}{}{}
\\newcommand{\\proofstep}[1]{%
  \\par
  \\addvspace{\\medskipamount}%
  \\stepcounter{proofstep}%
  \\noindent\\emph{Step \\theproofstep: #1}\\par\\nobreak\\smallskip
  \\@afterheading
}
\\makeatother

% Define \\widebar
\\makeatletter
\\let\\save@mathaccent\\mathaccent
\\newcommand*\\if@single[3]{%
  \\setbox0\\hbox{${\\mathaccent\"0362{#1}}^H$}%
        \\setbox2\\hbox{${\\mathaccent\"0362{\\kern0pt#1}}^H$}%
  \\ifdim\\ht0=\\ht2 #3\\else #2\\fi
  }
%The bar will be moved to the right by a half of \\macc@kerna, which is computed by amsmath:
\\newcommand*\\rel@kern[1]{\\kern#1\\dimexpr\\macc@kerna}
%If there's a superscript following the bar, then no negative kern may follow the bar;
%an additional {} makes sure that the superscript is high enough in this case:
\\newcommand*\\widebar[1]{\\@ifnextchar^{{\\wide@bar{#1}{0}}}{\\wide@bar{#1}{1}}}
%Use a separate algorithm for single symbols:
\\newcommand*\\wide@bar[2]{\\if@single{#1}{\\wide@bar@{#1}{#2}{1}}{\\wide@bar@{#1}{#2}{2}}}
\\newcommand*\\wide@bar@[3]{%
  \\begingroup
  \\def\\mathaccent##1##2{%
%Enable nesting of accents:
    \\let\\mathaccent\\save@mathaccent
%If there's more than a single symbol, use the first character instead (see below):
    \\if#32 \\let\\macc@nucleus\\first@char \\fi
%Determine the italic correction:
    \\setbox\\z@\\hbox{$\\macc@style{\\macc@nucleus}_{}$}%
    \\setbox\\tw@\\hbox{$\\macc@style{\\macc@nucleus}{}_{}$}%
    \\dimen@\\wd\\tw@
    \\advance\\dimen@-\\wd\\z@
%Now \\dimen@ is the italic correction of the symbol.
    \\divide\\dimen@ 3
    \\@tempdima\\wd\\tw@
    \\advance\\@tempdima-\\scriptspace
%Now \\@tempdima is the width of the symbol.
    \\divide\\@tempdima 10
    \\advance\\dimen@-\\@tempdima
%Now \\dimen@ = (italic correction / 3) - (Breite / 10)
    \\ifdim\\dimen@>\\z@ \\dimen@0pt\\fi
%The bar will be shortened in the case \\dimen@<0 !
    \\rel@kern{0.6}\\kern-\\dimen@
    \\if#31
      \\overline{\\rel@kern{-0.6}\\kern\\dimen@\\macc@nucleus\\rel@kern{0.4}\\kern\\dimen@}%
      \\advance\\dimen@0.4\\dimexpr\\macc@kerna
%Place the combined final kern (-\\dimen@) if it is >0 or if a superscript follows:
      \\let\\final@kern#2%
      \\ifdim\\dimen@<\\z@ \\let\\final@kern1\\fi
      \\if\\final@kern1 \\kern-\\dimen@\\fi
    \\else
      \\overline{\\rel@kern{-0.6}\\kern\\dimen@#1}%
    \\fi
  }%
  \\macc@depth\\@ne
  \\let\\math@bgroup\\@empty \\let\\math@egroup\\macc@set@skewchar
  \\mathsurround\\z@ \\frozen@everymath{\\mathgroup\\macc@group\\relax}%
  \\macc@set@skewchar\\relax
  \\let\\mathaccentV\\macc@nested@a
%The following initialises \\macc@kerna and calls \\mathaccent:
  \\if#31
    \\macc@nested@a\\relax111{#1}%
  \\else
%If the argument consists of more than one symbol, and if the first token is
%a letter, use that letter for the computations:
    \\def\\gobble@till@marker##1\\endmarker{}%
    \\futurelet\\first@char\\gobble@till@marker#1\\endmarker
    \\ifcat\\noexpand\\first@char A\\else
      \\def\\first@char{}%
    \\fi
    \\macc@nested@a\\relax111{\\first@char}%
  \\fi
  \\endgroup
}
\\makeatother")

;;;; Actually add the macros defined above to preview and export headers, and define custom export class:

  ;; Required to load the variables we modify below
  (require 'ox-latex)

  (setq mbv/org-format-latex-header-default
        "\\documentclass{article}
\\usepackage[usenames]{color}
[PACKAGES]
[DEFAULT-PACKAGES]
\\pagestyle{empty}             % do not remove
% The settings below are copied from fullpage.sty
\\setlength{\\textwidth}{\\paperwidth}
\\addtolength{\\textwidth}{-3cm}
\\setlength{\\oddsidemargin}{1.5cm}
\\addtolength{\\oddsidemargin}{-2.54cm}
\\setlength{\\evensidemargin}{\\oddsidemargin}
\\setlength{\\textheight}{\\paperheight}
\\addtolength{\\textheight}{-\\headheight}
\\addtolength{\\textheight}{-\\headsep}
\\addtolength{\\textheight}{-\\footskip}
\\addtolength{\\textheight}{-3cm}
\\setlength{\\topmargin}{1.5cm}
\\addtolength{\\topmargin}{-2.54cm}")
  (setq org-format-latex-header (concat mbv/org-format-latex-header-default mbv/my-latex-macros))
  ;; Define new class based on memoir
  (add-to-list 'org-latex-classes
               `("mbv/my-memoir-article"
                 ,(concat
                   "\\pdfoutput=1 % Required to make arXiv use pdflatex
\\documentclass[letterpaper,oneside,openany,article,english,10pt]{memoir}
[DEFAULT-PACKAGES]
[PACKAGES]
\\declaretheorem[sibling=theorem, style=plain]{corollary, lemma, proposition, conjecture}
\\declaretheorem[sibling=theorem, style=definition]{definition, example}
\\declaretheorem[sibling=theorem, style=remark]{remark, notation}
\\declaretheorem[numbered=no, style=remark]{acknowledgements}
"
                   mbv/my-latex-macros)
                 ("\\chapter{%s}" . "\\chapter*{%s}")
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")
                 ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

  (add-to-list 'org-latex-classes
               `("mbv/my-amsart"
                 ,(concat
                   "\\pdfoutput=1 % Required to make arXiv use pdflatex
\\documentclass{amsart}
[DEFAULT-PACKAGES]
[PACKAGES]
\\declaretheorem[numberwithin=section, style=plain]{theorem}  % Theorem environments using amsthm + thmtools
\\declaretheorem[sibling=theorem, style=plain]{corollary, lemma, proposition, conjecture}
\\declaretheorem[sibling=theorem, style=definition]{definition, example}
\\declaretheorem[sibling=theorem, style=remark]{remark, notation}
\\declaretheorem[numbered=no, style=remark]{acknowledgements}
"
                   mbv/my-latex-macros)
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")
                 ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

  ;; Set my amsart class as default for export
  (setq org-latex-default-class "mbv/my-amsart")

  ;; Add some bookmark-related options to the default hyperref template
  (setq org-latex-hyperref-template
        "\\hypersetup{
 pdfauthor={%a},
 pdftitle={%t},
 pdfkeywords={%k},
 pdfsubject={%d},
 pdflang={%L},
 final,
 bookmarks=true,
 bookmarksnumbered=true,
 bookmarksdepth=subsubsection}
 \\let\\subsectionautorefname\\sectionautorefname
 \\let\\subsubsectionautorefname\\sectionautorefname
"))
 #+end_src

 #+RESULTS:
 #+begin_example
 \hypersetup{
  pdfauthor={%a},
  pdftitle={%t},
  pdfkeywords={%k},
  pdfsubject={%d},
  pdflang={%L},
  final,
  bookmarks=true,
  bookmarksnumbered=true,
  bookmarksdepth=subsubsection}
  \let\subsectionautorefname\sectionautorefname
  \let\subsubsectionautorefname\sectionautorefname
 #+end_example

